Revit 2026 API

# ParameterFilterUtilitiesGetInapplicableParameters Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ElementId> GetInapplicableParameters(
	Document aDoc,
	ICollection<ElementId> categories,
	IList<ElementId> parameters
)
```
```vb
Public Shared Function GetInapplicableParameters (
	aDoc As Document,
	categories As ICollection(Of ElementId),
	parameters As IList(Of ElementId)
) As IList(Of ElementId)
```
```cpp
public:
static IList<ElementId^>^ GetInapplicableParameters(
	Document^ aDoc,
	ICollection<ElementId^>^ categories,
	IList<ElementId^>^ parameters
)
```
```fsharp
static member GetInapplicableParameters :
        aDoc : Document *
        categories : ICollection<ElementId> *
        parameters : IList<ElementId> -> IList<ElementId>
```

#### Parameters

aDoc Document

categories ICollectionElementId

parameters IListElementId

#### Return Value

IListElementId

#### Reference

ParameterFilterUtilities Class

Autodesk.Revit.DB Namespace